// fitur-fitur
// 1. menampilkan ayat saja
// 2. menampilkan beberapa ayat dari satu surah
// 3. menampilkan ayat dan terjemah


const axios = require("axios");
const cheerio = require('cheerio');

// 1. menampilkan ayat saja
let lihat_ayat = (nomor) => {
    axios.get('http://api.alquran.cloud/v1/ayah/'+nomor)
        .then(function (response) {
            console.log(response.data.data.text);
        })
        .catch(function (error) {
            console.log(error);
        });
};

// 2. menampilkan beberapa ayat dari satu surah
let range = (min, max) => [...Array(max - min + 1).keys()].map(i => i + min);
let lihat_beberapa_ayat = (num) => {
    let [surah, ayat] = num.split(':');
    let split = ayat.split('-');
    let offset = split[0] - 1;
    let limit = range(split[0], split[1]).length;
    axios.get('http://api.alquran.cloud/v1/surah/'+surah+'?offset='+offset+'&limit='+limit)
        .then((res) => {
            console.log(res.data);
        }).catch((err) => {
            console.error(err);
        });
};


// 3. menampilkan ayat dan terjemah
let lihat_ayat_terjemah = (nomor) => {
    axios.get('http://api.alquran.cloud/v1/ayah/'+nomor+'/editions/quran-uthmani,id.indonesian')
        .then(function (response) {
          let result = [];
            result.push({
              surah: response.data.data[0].surah.name,
              nomor: response.data.data[0].numberInSurah,
              ayat: response.data.data[0].text,
              arti: response.data.data[1].text
            });
            console.log(JSON.stringify(result));
        })
        .catch(function (error) {
            console.log(error);
        });
};

// 4. mencari ayat
let cari_ayat = (kata) => {
    axios.get('https://quran-tafsir.net/interface.php?term='+kata)
        .then(function (response) {
            let findings = response.data.results.items;
            console.log(findings);
        })
        .catch(function (error) {
            console.log(error);
        });
};

// 5. menampilkan satu surah lengkap
let buka_satu_surah = (surah) => {
    axios.get('http://api.alquran.cloud/v1/surah/'+surah+'/editions/quran-uthmani')
        .then((res) => {
            console.log(res.data);
        }).catch((err) => {
            console.error(err);
        });
};

// lihat_ayat('1:7');
lihat_beberapa_ayat('1:1-7');
// lihat_ayat_terjemah(262);
// cari_ayat('%D8%B1%D8%AC%D8%A7%D9%84');
// buka_satu_surah(2);

// beberapa ayat dan terjemah http://api.alquran.cloud/v1/surah/1/editions/quran-uthmani,id.indonesian?offset=0&limit=3

// menampilkan daftar tafsir
let kutub = [
      [
          "moqatel",
          "\n\nالعنوان: تفسير مقاتل (ت 150هـ). المؤلف: أبو الحسن، مقاتل بن سليمان بن بشير الأزدي بالولاء، البلخي. مفسر، متكلم، اختلف العلماء في أمره، فمنهم من وثقه، ومنهم من نسبه إلى الكذب، قال عنه الذهبي في التذكرة: \"هو متروك الحديث، وقد لطخ بالتجسيم مع أنه كان من أوعية العلم بحرا في التفسير\". نبذة عن الكتاب: هذا الكتاب من التفاسير المتقدمة، والبعض يعتبره أول تفسير كامل للقرآن الكريم. طبع بتحقيق عبد الله شحاته دار إحياء التراث الإسلامي. وبتحقيق أحمد فريد المزيدي، دار الكتب العلمية 2003م.\n\n"
      ],
      [
          "farraa",
          "العنوان: معاني القرآن للفراء (ت 207هـ)\nالمؤلف: أبو زكريا، يحيى بن زياد بن عبد الله بن منصور الديلمي المشهور بالفراء، من أعلم الكوفيين بالنحو واللغة والأدب وغيرها.\nنبذة عن الكتاب:\n يعد كتابه هذا من أقدم وأهم كتب الغريب والمعاني.\nطبع عدة طبعات منها: طبعة عالم الكتب، بيروت، الطبعة الثانية 1980م."
      ],
      [
          "tabary",
          "العنوان: جامع البيان عن تأويل آي القرآن للطبري (ت 310هـ).\nالمؤلف: أبو جعفر، محمد بن جرير الطبري نسبة الى طـبـرسـتان،  شيخ المفسرين.\nنبذة عن الكتاب:\nمن أجل التفاسير وأشهرها قال النووي : \" أجمعت الأمة على أنه لم يصنف مثل تفسير الطبري .\" وهو عبارة عن موسوعة جامعة لتراث التفسير في القرون الثلاثة الأولى.\nوهذا الكتاب من أوثق وأقدم ما دون في التفسير بالمأثور، قال عنه الإمام السيوطي: \"وكتابه أجل التفاسير وأعظمها فإنه يتعرض لتوجيه الأقوال وترجيح بعضها على بعض، والإعراب والاستنباط فهو يتفوق بذلك على تفاسير الأقدمين\".\nطبع طبعات كثيرة من أهمها:\nطبعة مكتبة البابي الحلبي في ثلاثين جزءاً عام 1373هـ. \nوطبعة بتحقيق العلامة أحمد محمد شاكر، وصل فيها إلى الآية 28 من سورة إبراهيم، وصدرت بين السنوات 1374هـ و 1388هـ.\nوطبعة بتحقيق الدكتور عبد الله بن عبد المحسن التركي، بالتعاون مع مركز البحوث والدراسات العربية والإسلامية بدار هجر، الطبعة الأولى 1422هـ."
      ],
      [
          "maturidy",
          "العنوان: تأويلات أهل السنة للماتريدي ( ت 333) \n المؤلف: أبو منصور، محمد بن محمد بن محمود الماتريدي السمرقندي الحنفي، الملقب ب( إمام المتكلمين) وإليه نسبة الماتريدية.\nنبذة عن الكتاب:\nهو كتاب في تفسير القرآن قال عنه الشيخ عبد القادر في الجواهر المضيئة : \"وهو كتاب لا يوازيه فيه كتاب بل لا يدانيه شيء من تصانيف من سبقه في ذلك الفن\".\nطبع بتحقيق فاطمة يوسف الخيمي، مؤسسة الرسالة ناشرون، بيروت، الطبعة الأولى 1425هـ- 2004م. وهي النسخة المعتمدة في \"الجامع\"."
      ],
      [
          "samarqandy",
          "العنوان: بحر العلوم للسمرقندي (ت 373هـ).\nالمؤلف: أبو الليث، نصر بن محمد بن بن أحمد، السمرقندي، الملقب بإمام الهدى، مفسر، محدث، صوفي من أئمة الحنفية. \nنبذة عن الكتاب:\t\nكتاب جامع بين التفسير بالمأثور والمعقول، غير أن الغالب عليه نصوص مروية في التفسير، قال فيه حاجي خليفة: \"وهو كتاب مشهور، لطيف مفيد\". \nطبع ببيروت بتحقيق محمود مطرجي، دار الفكر ، الطبعة الأولى 1418هـ - 1997م."
      ],
      [
          "zamanen",
          "العنوان: تفسير القرآن العزيز لابن أبي زمنين (ت 399هـ). \nالمؤلف: أبو عبد الله، محمد بن عبد الله بن عيسى، ابن أبي زمنين المري، فقيه مالكي، من الوعاظ والأدباء.\nنبذة عن الكتاب: \nمختصر لكتاب يحيى بن سلام في تفسير القرآن، حذف منه التكرار وبعض الزوائد، وأضاف المؤلف بعض الزيادات واعتنى كثيراً بالإعراب واللغة.\nطُبِعَ مُحَقَّقاً عام 1423هـ, دار الفاروق الحديثة- القاهرة."
      ],
      [
          "taalaby",
          "العنوان: الكشف والبيان في تفسير القرآن للثعلبي  (ت 427هـ).\nالمؤلف: أبو إسحاق، أحمد بن محمد بن إبراهيم، الثعلبي، ، مفسر ، حافظ، عالم بالعربية.\nنبذة عن الكتاب:\n يعد من التفاسير المتقدمة الجامعة بين المأثور والمعقول. ذكر أنه جمعه من مائة كتاب لكن قال ابن تيمية: \"والثعلبي هو في نفسه كان فيه خير ودين ولكنه كان حاطب ليل ينقل ما وجد في كتب التفسير من صحيح وضعيف وموضوع\".\nطبع بتحقيق سيد كسروي حسن، دار الكتب العلمية، بيروت، الطبعة الأولى: 1425هـ- 2004م."
      ],
      [
          "makky",
          "العنوان: الهداية إلى بلوغ النهاية لمكي بن أبي طالب (ت 437هـ)\nالمؤلف: أبو محمد، مكي بن أبي طالب القيسي، القيرواني القرطبي المالكي، اشتهر بالتأليف في القراءات وعلوم القرآن.\nنبذة عن الكتاب:\nأصل هذا الكتاب مجموعة رسائل جامعية أعدها الباحثون: صالح زارة، محمد علوي بنصر، الحسن بوقسيمي، الحسين عاصم، عبد الحق حنشي، مولاي عمر بنحماد، إبراهيم أصبان، عز الدين جوليد، عبد العزيز اليعكوبي، مصطفى رياح، مصطفى الصمدي، مصطفى فوضيل. تحت إشراف الدكتور الشاهد البوشيخي.\nويكتسي هذا التفسير أهمية خاصة من عدة جوانب منها: أنه ينتمي إلى فترة زمنية متقدمة، وأنه إبراز لجهد مهم من جهود علماء الغرب الإسلامي في مجال التفسير، كما أن إخراجه كان ثمرة لجهود أكاديمية متبوعة بمراجعة تدقيقية من قبل لجنة علمية من جامعة الشارقة.\nطبعته جامعة الشارقة، الطبعة الأولى 1429هـ."
      ],
      [
          "mawardy",
          "العنوان: النكت والعيون للماوردي (ت  450هـ).\nالمؤلف: الماوردي، أبو الحسن علي بن محمد البصري، القاضي، الشافعي، الأصولي، المفسر، الأديب. والماوردي نسبة إلى بيع ماء الورد. سكن بغداد وولي القضاء في بلدان كثيرة. يقال إنه كان يميل إلى مذهب الاعتزال في بعض المسائل، ولا يوافقهم في جميع أصولهم. \nنبذة عن الكتاب:\nيقول الماوردي في بيان مقصده ومنهجه: \"جعلت كتابي هذا مقصورا على تأويل ما خفي علمه وتفسير ما غمض تصوره وفهمه، وجعلته جامعا بين أقاويل السلف والخلف، وموضحا عن المؤتلف والمختلف...\".\nطبع بتحقيق خضر محمد خضر، وزارة الأوقاف والشؤون الإسلامية بدولة الكويت، مطابع مقهوي، الطبعة الأولى: 1402هـ 1982م."
      ],
      [
          "qoshairy",
          "العنوان: لطائف الإشارات للقشيري (ت 465هـ).\nالمؤلف: أبو القاسم، عبد الكريم ابن هوازن ابن عبد الملك بن طلحة بن محمد القشيري ، عالم بالفقه والتفسير والحديث والأصول والأدب والتصوف.\nنبذة عن الكتاب:\nوكتابه هذا تفسير صوفي كامل للقرآن الكريم، طبع بتحقيق سعيد قطيفة، المكتبة التوفيقية، القاهرة، وبتحقيق عبد اللطيف حسن عبد الرحمن، دار الكتب العلمية، بيروت، 1420هـ- 2000م."
      ],
      [
          "wahidy",
          "العنوان: الوجيز في تفسير الكتاب العزيز للواحدي (ت 468هـ).\nالمؤلف: أبو الحسن، علي بن محمد بن علي الواحدي، عالم بالتفسير والأدب.\nنبذة عن الكتاب:\nمن كتب التفسير بالمأثور، مع عناية باللغة والمعاني والفقه. طبع بمصر سنة 1305هـ بهامش \"التفسير المنير لمعالم التنزيل\"."
      ],
      [
          "baghawy",
          "العنوان: معالم التنزيل للبغوي (ت 516هـ).\nالمؤلف: الحسين بن مسعود بن محمد البغوي، المعروف بابن الفراء أو الفراء، ويلقب بمحيي السنة. حافظ محدث مفسر من فقهاء الشافعية، والبغوي نسبة إلى بَغَا من قرى خراسان.\nنبذة عن الكتاب:\nمن أجلّ الكتب وأنبلها حاوٍ للصحيح من الأقوال , عارٍ عن الغموض والتكلف محلى بالأحاديث النبوية والآثار الغالب عليها الصحة .\nقال ابن تيمية رحمه الله:\n\"والبغوي تفسيرة مختصر من الثعلبي لكنه صان تفسيرة عن الأحاديث الموضوعة والآراء المبتدعة\" . وقد سئل رحمه الله عن أي التفاسير أقرب إلى الكتاب والسنة ؟ الزمخشري أم القرطبي أم البغوي ؟ أو غير هؤلاء ؟ فأجاب : وأما التفاسير الثلاثة المسؤول عنها فأسلمها من البدعة والأحاديث الضعيفة - البغوي ."
      ],
      [
          "zamakhshary",
          "العنوان: الكشاف عن حقائق التأويل للزمخشري(ت  538هـ).\nالمؤلف: أبو القاسم محمود بن عمر بن محمد الزمخشري الخوارزمي، جار الله،  والزمخشري نسبة إلى زمخشر من قرى خراسان. إمام عصره في اللغة والنحو والبيان والتفسير.\nنبذة عن الكتاب:\nتفسيرٍ يكشف عن وجوه الإعجاز القرآني البلاغية، والأسلوبية، واللغوية.\nوهو أشهر تفاسير المعتزلة.\nطبع ، بمطبعة مصطفى البابي الحلبي وأولاده ـ مصر سنة 1385هـ ـ 1966م."
      ],
      [
          "atia",
          "العنوان: المحرر الوجيز في تفسير الكتاب العزيز لابن عطية (ت  542 هـ). \nالمؤلف: أبو محمد، عبد الحق بن غالب ابن عطية، الأندلسي الغرناطي،  مفسر قاض عارف بالأحكام والحديث، أديب، شاعر، من فقهاء المالكية.\nنبذة عن الكتاب:\nتأليف سهل العبارة ، يورد من التفسير المأثور ، ويختار منه في غير إكثار ، وينقل عن ابن جرير كثيراً ، كما ينقل عن غيره مع المناقشة، كثير الاستشهاد بالشعر العربي، معنيّ بالشواهد الأدبية، يحتكم إلى اللغة العربية لدى توجيهه بعض المعاني ، كثير الاهتمام بالصناعة النحوية.\nطبعته وزارة الأوقاف والشؤون الإسلامية بالمغرب، ثم طبع بدولة قطر بتحقيق عبد الله بن إبراهيم الأنصاري والسيد عبد العال السيد إبراهيم، الطبعة الأولى 1402هـ- 1982م."
      ],
      [
          "alrazy",
          "العنوان: مفاتيح الغيب ( التفسير الكبير) للرازي (ت  606هـ).\nالمؤلف: أبو عبد الله، محمد بن عمر بن الحسين، فخر الدين الرازي،. مفسر متكلم أشعري من أئمة الشافعية. \nنبذة عن الكتاب:\nمن أشهر التفاسير التي تصنف ضمن التفسير بالرأي، اعتنى فيه المؤلف ببيان التناسب بين الآيات والسور، وفيه استطراد وتوسع في الحديث عن العلوم الكونية والمسائل الكلامية والفلسفية والفقهية وغيرها. كما يتضمن ردودا على الفرق والنحل والمذاهب كالمعتزلة والفلاسفة وغيرهم. كما أنه يضم استنباطات دقيقة مفيدة. \nومن المعروف أن الرازي لم يكمله ، فجاء شهاب الدين الخوبي الدمشقي (ت  639هـ ) وأكمل قسما منه ، ثم جاء بعده نجم الدين القمولي (ت  727هـ ) فأتمه إلى الأخير ، دون أن يتميز الأصل من التكمل. \nطبع ببيروت، دار الكتب العلمية، الطبعة الأولى 1418هـ- 1997م."
      ],
      [
          "alez",
          "العنوان: تفسير القرآن للعز بن عبد السلام (ت 660هـ)\nالمؤلف: العز بن عبد السلام، السلمي الدمشقي الشافعي . سلطان العلماء، من فقهاء الشافعية المجتهدين.\nنبذة عن الكتاب:\nهذا الكتاب مختصر جيد لكتاب (النكت والعيون) للماوردي. \nطبع بتحقيق الدكتور عبد الله الوهيبي، في ثلاث مجلدات، دار  ابن حزم، ببيروت 1416هـ - 1996م.\nثم طبع مجردا عن الهوامش والتعليقات في مجلد واحد ، بنفس الدار،  الطبعة الأولى: 1422هـ- 2003م."
      ],
      [
          "qortoby",
          "العنوان: الجامع لأحكام القرآن والمبين لما تضمنه من السنة وآي الفرقان للقرطبي (ت  671هـ).\nالمؤلف: أبو عبد الله، محمد بن أحمد بن أبي بكر بن فرح القرطبي، الأنصاري الخزرجي الأندلسي المالكي، من كبار المفسرين، محدث، فقيه.\nنبذة عن الكتاب:\nهذا الكتاب من أجمع ما صنف في أحكام القرآن،  ولم يقتصر عليها.  بل شرح سائر الآيات.مع عناية بأسباب النزول ، القراءات ، واللغات ووجوه الإعراب ، وتخريج الأحاديث ، وبيان غريب الألفاظ ، والاستشهاد بأشعار العرب وعرض أراء الفقهاء وأقاويل المفسرين، مع النقد والرد.\nطبع عدة طبعات أولها عام 1933م بمصر وآخرها طبعة رابطة العالم الإسلامي 1427هـ 2006م."
      ],
      [
          "baidawy",
          "العنوان: أنوار التنزيل و أسرار التأويل للبيضاوي (ت 685هـ).\nالمؤلف: أبو سعيد عبد الله بن عمر بن محمد ناصر الدين البيضاوي، نسبة إلى المدينة البيضاء قرب شيراز. قاضٍ، مفسر، عالم بالفقه والأصلين والعربية والمنطق، من أعيان الشافعية.\nنبذة عن الكتاب:\nقال في كشف الظنون: \"وتفسيره هذا كتاب عظيم الشأن، غني عن البيان، لخص فيه من الكشاف ما يتعلق بالإعراب والمعاني والبيان، ومن التفسير الكبير ما يتعلق بالحكمة والكلام، ومن تفسير الراغب ما يتعلق بالاشتقاق وغوامض الحقائق ولطائف الإشارات وضم إليه ما ورى زناد فكره من الوجوه المعقولة والتصرفات المقبولة\".\nوهذا التفسير مشهور ومتداول في القديم والحديث ، وطبع عدة طبعات وقرر للتدريس في كثير من الجامعات والمعاهد الدينية ، وله شروح كثيرة جدا ، وحواش كبيرة ، أشهرها حاشية الشهاب الخفاجي. \nطبع أكثر من مرة."
      ],
      [
          "nasafy",
          "\n\nالعنوان: مدارك التنزيل وحقائق التأويل للنسفي (ت 710 هـ). المؤلف: أبو البركات، عبد الله بن أحمد بن محمود النسفي، ، حافظ الدين، مفسر، متكلم، أصولي، من فقهاء الحنفية، ونسبته إلى نسف من بلاد السند بين جيجون وسمرقند. نبذة عن الكتاب: وهو تفسير مختصر مفيد من تفسير البيضاوي ، ومن الكشاف للزمخشري ، فجاء ، كما قال المؤلف: \" كتابا وسطا في التأويلات ، جامعا لوجوه الإعراب والقراءات ، متضمنا لدقائق علمي البديع والإشارات حاليا بأقاويل أهل الستة والجماعة ، خاليا عن أباطيل أهل البدع والضلالة ، ليس بالطويل الممل ، ولا بالقصير المخل\" والكتاب مشهور ومطبوع عدة طبعات كما قرر للتدريس في كثير من المعاهد الدينية.\n\n"
      ],
      [
          "khazen",
          "العنوان: لباب التأويل في معاني التنزيل للخازن (ت  741هـ)،\nالمؤلف: أبو الحسن علي بن محمد الخازن،، صوفي عالم بالتفسير والحديث، مشارك في بعض العلوم، من فقهاء الشافعية، وكان خازن الكتب بالمدرسة السميساطية في دمشق. \nنبذة عن الكتاب:\nهذا الكتاب تهذيب لتفسير الإمام البغوي يقول الخازن: \"ولم أجعل لنفسي تصرفا سوى النقل والانتخاب\". ابتعد فيه عن التطويل، وحذف منه الأسانيد، وأورد فيه التفسير الإفرادي والإجمالي واللغوي، وفضائل السور، وأسباب النزول، معتمدا في ذلك غالبا على الأحاديث النبوية والآثار الصحيحة مع تخريج الأحاديث والآثار، إضافة إلى الشواهد الشعرية العربية.\nثم يقول الدكتور محمد حسين الذهبي: \"هذا التفسير يطرق مواضيع كثيرة في نواح من العلم مختلفة، ولكن شهرته القصصية، وسمعته الإسرائيلية، أساءت إليه كثيرا، وكادت تصد الناس عن الرجوع إليه والتعويل عليه\".\nطبع ببيروت بتحقيق عبد السلام محمد علي شاهين، دار الكتب العلمية، الطبعة الأولى 1425هـ- 2004م."
      ],
      [
          "jezzy",
          "العنوان: التسهيل لعلوم التنزيل لابن جزي (ت  741هـ). \nالمؤلف: ، أبو القاسم، محمد بن أحمد بن محمد ابن جزي الكلبي. فقيه مالكي عالم بالأصول والتفسير واللغة، من أهل غرانطة.\nنبذة عن الكتاب:\nتفسير وجيز جامع لأقوال المفسرين متضمن لعدة فوائد مما أخذه عن شيوخه أو مما التقطه من الكتب، مع حسن العبارة وتحقيق الأقوال وتمييز الراجح من المرجوح. \nطبع ببيروت، دار الفكر."
      ],
      [
          "hayyan",
          "العنوان: البحر المحيط لأبي حيان (ت  745هـ).\nالمؤلف: أبو حيان النحوي، محمد بن يوسف بن علي، الغرناطي نحوي، لغوي، مفسر، محدث، مقرئ، مؤرخ، أديب، كان ظاهري المذهب ثم تحول شافعيا. \nنبذة عن الكتاب:\nاشتهر هذا الكتاب بغلبة الناحية النحوية على مادته، يضاف إلى ذلك اهتمام مؤلفه بالناحية البلاغية والأحكام الفقهية .\nطبع بالقاهرة، دار الكتاب الإسلامي، الطبعة الثانية 1413هـ -1992م."
      ],
      [
          "halaby",
          "العنوان: الدر المصون في علم الكتاب المكنون للسمين الحلبي  (ت  756هـ).\nالمؤلف: أبو العباس أحمد بن يوسف بن عبد الدايم السمين ، الحلبي،  نحوي، مقرئ مفسر، من فقهاء الشافعية، \nنبذة عن الكتاب:\nكتاب جامع لأقوال السابقين، فيه عناية كبيرة بشرح الألفاظ، وذكر الآراء المختلفة في الإعراب، وأوجه القراءات، والبلاغة، وذكر الكثير من الشواهد الشعرية. وقال صاحب كشف الظنون: \"لخصه من البحر المحيط لأبي حيان وناقشه فيه كثيرا\".\nطبع بتحقيق د. أحمد محمد الخراط، بدمشق، دار القلم، الطبعة الأولى: 1406هـ- 1986م."
      ],
      [
          "katheer",
          "العنوان: تفسير القرآن العظيم لابن كثير (ت  774هـ).\nالمؤلف: ابن كثير، أبو الفداء إسماعيل بن عمر بن كثير القرشي الدمشقي، عماد الدين، مؤرخ مفسر محدث، من فقهاء الشافعية.\nنبذة عن الكتاب:\nمن أهم كتب التفسير بالمأثور، مع وجازة لفظه وشمول معانيه، وقد تلقته الأمة بالقبول قديما وحديثا، واشتهر عند العامة والخاصة. قال أحمد شاكر في اختصار لهذا التفسير : وبعد فإن تفسير الحافظ ابن كثير أحسن التفاسير التي رأينا ، وأجودها وأدقها بعد تفسير إمام المفسيرين أبي جعفر الطبري\". \nطبع طبعات كثيرة من أحسنها طبعة دار طيبة للنشر والتوزيع. بتحقيق : سامي بن محمد سلامة. الطبعة : الثانية 1420هـ - 1999 م."
      ],
      [
          "naisabory",
          "العنوان: غرائب القرآن ورغائب الفرقان للنيسابوري (ت  850هـ).\nالمؤلف: الحسن بن محمد بن الحسين القمي النيسابوري، نظام الدين. \nنبذة عن الكتاب:\nكتاب جامع لخلاصة ما في تفسير الرازي والزمخشري، مع إضافات ووقفات في علوم مختلفة لها صلة بالتفسير كالقراءات وغيرها.\nطبع بدار الكتب العلمية، بيروت، الطبعة الأولى: 1416هـ - 1996م."
      ],
      [
          "thaaliby",
          "العنوان: الجواهر الحسان في تفسير القرآن للثعالبي (ت  875هـ).\nالمؤلف: أبو زيد عبد الرحمن بن محمد بن مخلوف الثعالبي، مفسر من كبار علماء الجزائر وصلحائها.\nنبذة عن الكتاب:\nتفسير أثري مختصر من تفسير ابن عطية الذي يعتبره ابن خلدون عصارة التفاسير المتقدمة عليه، غير أن شخصيته حاضرة في هذا التفسير بما أورده من التعقيبات والترجيحات بالنسبة لابن عطية وغيره من المفسرين، كما أنه اعتنى بالناحية التربوية بالتركيز على مواعظ القرآن.\nطبع أكثر من مرة: \nطبعة قديمة في الجزائر سنة1327 في المطبعة الثعالبية دون عناية أو تحقيق، ذيل بمعجم مختصر للمؤلف في شرح غريب بعض ألفاظ القرآن وطبع بآخر التفسير .\nوله طبعة أخرى قديمة بعناية محمد بن المصطفى ابن الخوجة بالجزائر سنة 1905م.\nوله طبعتان حديثتان: الأولى بتحقيق عمار الطالبي – المؤسسة الوطنية للكتاب\nوالثانية بتحقيق محمد الفاضلي – المكتبة العصرية – بيروت سنة 1417هـ."
      ],
      [
          "adel",
          "العنوان: اللباب في علوم الكتاب لابن عادل (ت 880هـ).\nالمؤلف: أبو حفص عمر بن علي الدمشقي ابن عادل، الحنبلي النعماني، فقيه، مفسر. لا توجد له ترجمة وافية.\nنبذة عن الكتاب:\nقدّم له المؤلف بكلمات قليلة جدا فقال \".. وبعد فهذا كتاب جمعته من أقوال العلماء في علوم القرآن وسمّيته: \"اللباب في علوم الكتاب\". ولم يزد على ذلك شيئا.\nوهذا الكتاب موسوعة جامعة لتفسير القرآن الكريم ومباحث متنوعة من علومه. واهتم المؤلف فيه أيضا ببيان معاني المفردات و عرض الأمور النحوية ووجوه الإعراب، والشواهد الشعرية، كما يعرض لأوجه القراءات وأقوال المفسرين، ويعقد فصولا كثيرة في أمور تتعلق بالآيات من الناحية العقدية والفقهية والوعظية وغير ذلك. \nطبع ببيروت بتحقيق علي معوض وعادل عبد الموجود  دار الكتب العلمية الطبعة الأولى: 1998."
      ],
      [
          "beqaay",
          "العنوان: نظم الدرر في تناسب الآيات والسور للبقاعي (ت  885هـ). \nالمؤلف: أبو الحسن إبراهيم بن عمر بن حسن الرُّباط بن علي، برهان الدين البقاعي، مفسر، مؤرخ، محدّث، أديب، والبقاعي نسبة إلى البقاع في لبنان.\nنبذة عن الكتاب:\nتفسير نفيس لمعاني القرآن الكريم، مع اعتناء خاص ببيان وجوه التناسب بين آيات القرآن الكريم وسوره. \nمطبوع."
      ],
      [
          "eejy",
          "العنوان: جامع البيان في تفسير القرآن للإيجي (ت 905هـ)\nالمؤلف: محمد بن عبد الرحمن بن محمد بن عبد الله الإيجي. مفسر، من فقهاء الشافعية،وكان مفتيا في بلده.\nنبذة عن الكتاب:\nتفسير مختصر جيد، علق عليه العلامة السيد محمد بن عبد الله الغزنوي (1296هـ) \nطبع في لاهور سنة 1879 م. والثانية: بدلهي سنة 1296هـ.\nثم طبع بدار الكتب العلمية بحاشية الغزنوي, وبتحقيق د. عبد الحميد هنداوي, عام 1424. وهي النسخة المعتمدة في \"الجامع\".\nوطبع أخيرا بدار غراس للنشر والتوزيع بالكويت ، 1428هـ قدم له وراجعه صلاح الدين مقبول أحمد."
      ],
      [
          "jalalen",
          "العنوان: تفسير الجلالين بدأه جلال الدين المَحلِّي (864هـ) وأتمه جلال الدين السيوطي (ت 911هـ)\nالمؤلف: محمد بن أحمد بن محمد بن إبراهيم بن أحمد، جلال الدين المحلي: ، مفسر، أصولي، من فقهاء المالكية.قال عنه السخاوي:\" كان إماما. علامة محققا نظارا مفرط الذكاء صحيح الذهن\". \nعبد الرحمن بن أبي بكر بن محمد جلال الدين السيوطي حافظ مؤرخ محدث مفسر أديب.\nنبذة عن الكتاب:\n( تفسير الجلالين) كتاب في تفسير القرآن الكريم بدأه المحلي ولم يكمله، فأتمه جلال الدين السيوطي على نمطه، فسمي ( تفسير الجلالين). وهو مع صغر حجمه كبير المعنى قيل بأنه لب لباب التفاسير. وشرح الجلالين لمحمد بن محمد الكرخي وهو كبير في مجلدات سماه ( مجمع البحرين ومطلع البدرين)."
      ],
      [
          "seoty",
          "العنوان: الدر المنثور في التفسير بالمأثور للسيوطي (ت  911هـ). \nالمؤلف: عبد الرحمن بن أبي بكر بن محمد جلال الدين  السيوطي، حافظ مؤرخ محدث مفسر أديب.\nنبذة عن الكتاب:\nاقتصر فيه على جمع ما ورد عن الصحابة والتابعين في التفسير، وضم لها ما ورد فيها من الأحاديث المخرجة من كتب الصحاح والسنن وبقية كتب الحديث ، وحذف الأسانيد للاختصار ، مقتصرا على متن الحديث. كل ذلك على سبيل السرد من غير تعقيب أو تصحيح أو ترجيح. \nطبع ببيروت، دار الكتب العلمية الطبعة الأولى 1421هـ- 2000م."
      ],
      [
          "sherbiny",
          "العنوان: السراج المنير في الإعانة على معرفة بعض معاني كلام ربنا الحكيم الخبير للشربيني (ت  977هـ).\nالمؤلف: أبو الحسن علي بن عبد الرحمن بن محمد الخطيب الشربيني، مفسر ، من فقهاء الشافعية والشربيني نسبة إلى شربين الغربية بمصر.\nنبذة عن الكتاب:\nاقتصر فيه المؤلف على أرجح الأقوال وإعراب ما يحتاج إليه عند السؤال، وترك التطويل بذكر أقوال غير مرضية وأعاريب محلها كتب العربية، وحيث ذكر فيه شيئاً من القراءات فهو من السبع المشهورات، وقد يذكر بعض أقوال وأعاريب لقوّة مداركها أو لورودها ولكن بصيغة قيل ليعلم أن المرضي أوّلها.\nطبع ببيروت، دار الكتب العلمية، الطبعة الأولى 1425هـ - 2004م."
      ],
      [
          "sood",
          "العنوان: إرشاد العقل السليم إلى مزايا الكتاب الكريم لأبي السعود (ت  982هـ).\nالمؤلف: أبو السعود، محمد بن محمد بن مصطفى العمادي، مفسر، أصولي، شاعر، عارف باللغات العربية والتركية والفارسية، من فقهاء الحنفية وعلماء الترك المستعربين.\nنبذة عن الكتاب:\nاعتمد فيه على تفسير الكشاف والبيضاوي وغيرهما. قال صاحب كشف الظنون:\n\"اشتهر صيته وانتشر نسخه في الأقطار ووقع التلقي بالقبول من الفحول والكبار لحسن سبكه ولطف تعبيره فصار يقال له خطيب المفسرين، ومن المعلوم أن تفسير أحد سواه بعد الكشاف والقاضي لم يبلغ إلى ما بلغ من رتبة الاعتبار والاشتهار والحق انه حقيق به مع ما فيه من المنافي لدعوى التنزيه\".\nطبع أول مرة سنة 1275هـ في بولاق بمصر. ثم طبع بعد ذلك في طبعات."
      ],
      [
          "aaqam",
          "العنوان: تفسير الأعقم (ت 999هـ)\t\nالمؤلف: أحمد بن علي بن محمد بن علي الأعقم الآنسي، عالم، فقيه، مفسر، زيدي، ولد في قرية (مسْطح)، عزلة (القارة)، في بلاد (آنس) في محافظة ذمار، وتوفي ودفن في مدينة صنعاء. \nنبذة عن الكتاب:\n هو تفسير مختصر، طبع في مجلد عن دار الحكمة اليمانية."
      ],
      [
          "shawkany",
          "العنوان: فتح القدير الجامع بين فني الرواية والدراية من علم التفسير للشوكاني (ت  1250هـ).\nالمؤلف: أبو عبد الله محمد بن علي بن محمد الشوكاني، فقيه، أصولي، محدث، مفسر، من كبار علماء اليمن، والشوكاني نسبة إلى هجرة شوكان باليمن.\nنبذة عن الكتاب:\nمن أهم التفاسير الجامع بين النقل والرأي.  يذكر مجموعة من الآيات ، ثم يبين معانيها، اعتمادا على أقوال المفسرين وأئمة اللغة، مع النقد والترجيح ، ثم يختم تفسير تلك الآيات بالأحاديث والأخبار التي وردت عن رسول الله صلى الله عليه وسلم ، وعن السلف.\nطبع ببيروت بتحقيق سعيد محمد اللحام، دار الفكر،  1414هـ- 1993م."
      ],
      [
          "alusy",
          "العنوان: روح المعاني في تفسير القرآن العظيم والسبع المثاني للآلوسي (ت  1270هـ).\nالمؤلف: أبو الثناء محمود بن عبد الله  شهاب الدين الألوسي، شيخ علماء العراق في عصره، مفسر صوفي، محدث، فقيه أديب، لغوي مشارك في بعض العلوم.\nنبذة عن الكتاب:\nتفسير جامع للنقل والرأي، مع عناية ببيان التناسب بين الآيات والسور. وعرض القراءات وووجوه الإعراب، والاستشهاد بأشعار العرب ، مع التفات إلى الآيات الكونية ،  وذكر أقوال الفقهاء وأدلتهم في آيات الأحكام ، مع الترجيح دون تعصب لمذهب فقهي معين ، ثم إن المفسر يذيل تفسير الآيات بما يظهر له من المعاني على طريقة أهل الإشارة.\nطبع ببيروت، دار إحياء التراث العربي."
      ],
      [
          "seddiq",
          "العنوان: فتح البيان في مقاصد القرآن للقنوجي صديق حسن خان (ت 1307هـ)\nالمؤلف: أبو الطيب: محمد صديق خان بن حسن بن علي ابن لطف الله الحسيني القنوجي الهندي البخاري، من رجال الإصلاح الإسلامي.\nنبذة عن الكتاب:\nطبع بالمكتبة العصرية، بيروت، عني بضبطه وقدم له وراجعه عبد الله بن إبراهيم الأنصاري.1412هـ- 1992م. وهي النسخة المعتمدة في \"الجامع\"."
      ],
      [
          "qasimi",
          ") العنوان: محاسن التأويل للقاسمي. (ت 1332هـ)\nالمؤلف: جمال الدين بن محمد سعيد بن قاسم، القاسمي: إمام الشام في علوم الدين وفنون الأدب. ألقى دوسا في التفسير والوحيد والحديث والأخلاق والتاريخ والأدب.\nنبذة عن الكتاب:\nمن أشهر التفاسير في العصر الحديث، طبعته دار إحياء التراث العربي، بيروت، بتحقيق الأستاذ محمد فؤاد عبد الباقي، واعتنى به وصححه الشيخ هشام سمير البخاري، الطبعة الأولى 1415هـ- 1994م. وهي النسخة المعتمدة في \"الجامع\"."
      ],
      [
          "fareed",
          "العنوان: المصحف المفسّر لفريد وجدي (ت 1373هـ)\nالمؤلف: محمد فريد بن مصطفى وجدي بن علي رشاد: كاتب إسلامي متعمق بدراسة الإسلام وأصوله وتاريخه، وأحد مشاهير قادة الفكر في مصر، أصدر مجلة \" الحياة\" وجريدة \"الدستور\" و ومجلة \"الوجديات\" يقول عنه العقاد: قليل النظير في نزاهته وصدقه وغيرته على المصلحة القومية واستعداده للتضحية بماله وراحته في سبيل المبدأ الذي يرعاه، ولا يتزحزح عنه قيد أنملة.\nنبذة عن الكتاب: \nتفسير مختصر مشهور، طبع بدار المعارف بالقاهرة 1986م. وهي النسخة المعتمدة في البرنامج."
      ],
      [
          "saady",
          "العنوان: تيسير الكريم الرحمن في تفسير كلام المنان للسعدي  (ت  1376 هـ).\nالمؤلف: السعدي، عبد الرحمن بن ناصر، عالم سعودي، كان ذا معرفة بالفقه أصوله وفروعه.\nنبذة عن الكتاب:\nمن تفاسير السلفية التي عنيت بالعقيدة بما تشمله من توحيد الربوبية، وتوحيد الإلهية، وتوحيد الأسماء والصفات.  وقد صيغ بأسلوب سهل واضح، ويمكن تصنيفه ضمن كتب التفسير بالمأثور. \nطبع بالمملكة العربية السعودية، دار الذخائر 1422هـ- 2001م.\nوطبعته  مؤسسة الرسالة بتحقيق عبد الرحمن بن معلا اللويحق، الطبعة : الأولى 1420هـ -2000 م."
      ],
      [
          "qotb",
          "العنوان: في ظلال القرآن لسيد قطب (ت  1387هـ).\nالمؤلف: قطب، سيد بن قطب بن إبراهيم، كاتب عالم بالتفسير، من كبار المفكرين الإسلاميين والأدباء في مصر في الثلث الثاني من القرن العشرين ومن شهداء النهضة الإسلامية الحديثة. \nنبذة عن الكتاب:\nكتاب الظلال من أهم كتب التفسير في العصر الحديث، أبان فيه عن معاني القرآن الكريم بلغة راقية وأسلوب رفيع، مستخلصا منه ما يجلي شمولية المنهج الإسلامي وقوته، ومستخلصا منه ما يمكن تسميته بالهدى المنهاجي الذي يفيد المسلم في تمثل الإسلام والدعوة إليه. هذا فضلا عن نقده لكثير من الأفكار المنحرفة والأخبار الواهية الواردة في مصادر التفسير.\nوقد طبع الكتاب طبعات كثيرة."
      ],
      [
          "ashour",
          "العنوان: التحرير والتنوير من التفسير لابن عاشور (ت  1393هـ).\nالمؤلف: ابن عاشور، محمد الطاهر، رئيس المفتين المالكيين بتونس، وأحد كبار علمائها، مفسر، لغوي، نحوي، أديب، من دعاة الإصلاح.\nنبذة عن الكتاب:\nواسم التفسير المذكور هو المختصر لاسمه الطويل\"تحرير المعنى السديد وتنوير العقل الجديد وتفسير الكتاب المجيد\" ذكر ذلك في المقدمة.\nويعتبر في الجملة تفسيرا بلاغيا بيانيا لغويا عقلانيا لا يغفل المأثور ويهتم بالقراءات . مع عناية بذكر محاور كل سورة والتنبيه على التناسب بين الآيات والسور. طبع بتونس، الدار التونسية للنشر، 1984م."
      ],
      [
          "qattan",
          "العنوان:تيسير التفسير لإبراهيم القطان (ت 1405هـ)\nالمؤلف: قاضي القضاة.\nنبذة عن الكتاب:\nطبع الطبعة الأولى بعَمّان، 1402هـ- 1982م، بمراجعة وضبط وإشراف عمران أحمد أبو حجله."
      ],
      [
          "darwazeh",
          "العنوان: التفسير الحديث لمحمد عزة دروزة. (ت1404هـ)\nالمؤلف: محمد عزة دروزة \nنبذة عن الكتاب:\nتفسير مرتب وفق ترتيب نزول السور، يهدف من خلاله المؤلف إلى متابعة السيرة النبوية زمنا بعد زمن، ومتابعة أطوار التنزيل ومراحله بشكل واضح. وقد اعتمد الترتيب الذي جاء في مصحف الخطاط قدروغلي مع مخالفته بعض الشيء ترجيحا للتفسير حسب الروايات الراجحة في ترتيب نزول السور مع المحافظة على وحدة السورة.\nطبع الطبعة الأولى بدار إحياء الكتب العربية- القاهرة سنة 1381*1383هـ/1961-1964م وطبع الطبعة الثانية سنة 1421هـ - 2000 م بدار الغرب الإسلامي. وهي النسخة المعتمدة في \"الجامع\"."
      ],
      [
          "makhloof",
          "العنوان: صفوة البيان لمعاني القرآن لحسنين محمد مخلوف(ت 1410هـ).\nالمؤلف: حسنين محمد مخلوف مفتي الديار المصرية السابق وعضو جماعة كبار العلماء.\nنبذة عن الكتاب:\nتفسير واضح العبارة، داني المجتنى، مقتصرا على ما لابد من تفسيره من الآيات والمفردات.\nطبع بدار الرشاد الحديثة. وهي النسخة المعتمدة في \"الجامع\"."
      ],
      [
          "jazaery",
          "العنوان: أيسر التفاسير لكلام العلي الكبير للجزائري.\nالمؤلف: الجزائري أبو بكر جابر بن موسى بن عبد القادر. ولد بالجزائر وتعلم بها، ثم انتقل إلى المدينة المنورة ارتحل مع أسرته إلى المدينة المنورة ، وفي المسجد النبوي الشريف استأنف طريقه العلمي بالجلوس إلى حلقات العلماء والمشايخ حيث حصل بعدها على إجازة من رئاسة القضاء بمكة المكرمة للتدريس في المسجد النبوي. فأصبحت له حلقة يدرس فيها تفسير القرآن الكريم، والحديث الشريف ، وغير ذلك. وهو معروف بنشاطه الدعوي.\nنبذة عن الكتاب:\nفيه عناية يشرح المفردات وبيان المعنى الإجمالي وذكر المناسبات واستخلاص ما ترشد إليه الآيات من الهدايات والأحكام والفوائد معتمدا في العقائد على مذهب السلف، وفي الأحكام على المذاهب الأربعة لا يخرج عنها.\nطبع بالمدينة المنورة،  دار العلوم والحكم. وطبع بالقاهرة، دار السلام، سنة 1994م."
      ],
      [
          "toalab",
          "العنوان: فتح الرحمن في تفسير القرآن. \nالمؤلف: عبد المنعم أحمد تعيلب\nنبذة عن الكتاب:\nطبع الطبعة الأولى بالقاهرة، دار السلام، 1416هـ/1995م. وهي النسخة المعتمدة في \"الحامع\"."
      ],
      [
          "moyassar",
          "العنوان: التفسير الميسر.\nالمؤلف: مجموعة من العلماء\nنبذة عن الكتاب:\nكتاب مختصر جامع بأسلوب سهل، مع الحرص على الصحيح من المأثور، والعناية بإبراز الهداية القرآنية.\nطبع بالمدينة المنورة، مجمع الملك فهد لطباعة المصحف الشريف، 1418هـ."
      ],
      [
          "amir",
          "العنوان: التفسير الشامل لأمير عبد العزيز\nالمؤلف: أمير عبد العزيز.\nنبذة عن الكتاب:\nطبع بالقاهرة، دار السلام، 1420هـ/2000م."
      ],
      [
          "basheer",
          "العنوان: التفسير الصحيح ( موسوعة الصحيح المسبور من التفسير بالمأثور) \nالمؤلف: حكمت بن بشير بن ياسين.\nنبذة عن الكتاب:\nطبع بالمدينة المنورة، دار المآثر، 1420هـ/1999م. وهي النسخة المعتمدة في \"الجامع\"."
      ],
      [
          "montakhab",
          "العنوان: المنتخب في تفسير القرآن الكريم.\nالمؤلف: لجنة علماء الأزهر - المجلس الأعلى للشؤون الإسلامية.\nنبذة عن الكتاب:\nتفسير بأسلوب عصري مبسط واضح، وجيز بعيد عن الخلافات المذهبية، والمصطلحات الفنية والحشو والتعقيدات اللفظية.\nطبعه المجلس الأعلى للشؤون الإسلامية بجمهورية مصر العربية، طبعات كثيرة منها الطبعة العشرون، بتاريخ 1423هـ- 2002م."
      ],
      [
          "shehata",
          "العنوان: تفسير القرآن الكريم لعبد الله شحاتة (ت 1424هـ)\nالمؤلف: عبد الله محمود شحاتة.\nنبذة عن الكتاب:\nطبع الطبعة الثانية بدار غريب بالقاهرة،: 2000م."
      ],
      [
          "tantawy",
          "العنوان: التفسير الوسيط للقرآن الكريم. \nالمؤلف: محمد السيد طنطاوي شيخ الأزهر.\nنبدة عن الكتاب:\nطبع بدار المعارف، القاهرة: 1993م."
      ]
    ];
let daftar_tafsir = () => {
  // let list = ['moqatel', 'farraa', 'tabary', 'maturidy', 'samarqandy', 'zamanen', 'taalaby', 'makky', 'mawardy', 'qoshairy', 'wahidy', 'baghawy', 'zamakhshary', 'atia', 'alrazy', 'alez', 'qortoby', 'baidawy', 'nasafy', 'khazen', 'jezzy', 'hayyan', 'halaby', 'katheer', 'naisabory', 'thaaliby', 'adel', 'beqaay', 'eejy', 'jalalen', 'seoty', 'sherbiny', 'sood', 'aaqam', 'shawkany', 'alusy', 'seddiq', 'qasimi', 'fareed', 'saady', 'qotb', 'ashour', 'qattan', 'darwazeh', 'makhloof', 'jazaery', 'toalab', 'moyassar', 'amir', 'basheer', 'montakhab', 'shehata', 'tantawy'];
    for (var i = 0; i < kutub.length; i++) {
      console.log('Kode: '+ i);
      console.log('Kitab: '+kutub[i][1]);
    }
};

// daftar_tafsir();
let split_or_no = (str) => {
    if(str.includes('-')){
        str = str.split('-');
        return str
    }
    return str;
};
let id_to_code = (id_tafsir) => {
    let ktb = split_or_no(id_tafsir);
    let codes = [];
    for (let i = 0; i < ktb.length; i++) {
        let id = parseInt(ktb[i]);
        codes.push([
            kutub[id][0]
        ]);
    }
    return codes
};
let id_tafsir = (str) => {
    let list = id_to_code(str);
    let text = '';
    for(let [index, value] of list.entries()) {
      (index > 0) ? text += '-'+value : text += value
    }
    return text;
};
let tafsir_ayat = (surah_ayat, ids) => {
    let [surah, ayat] = surah_ayat.split(':');
    let tafsir = id_tafsir(ids);
    let results = [];
    axios.get('https://quran-tafsir.net/'+tafsir+'/sura'+surah+'-aya'+ayat+'.html')
        .then((res) => {
            const html = res.data;
            const $ = cheerio.load(html);
            let selector = $('.panel-success');
            selector.each((index, element) => {
                results.push({
                    nama_kitab: $(element).find('strong').text(),
                    tafsir_ayat: $(element).find('.nass').text()
                })
            })
            console.log(results);
        }).catch((err) => {
            console.error(err);
        });
};
// tafsir_ayat('1:1', '0-1-2');